Projet-M2-GGB/Microphone_wav_SD/Microphone_wav_SD.ioc
STMicroelectronics.X-CUBE-AI.10.0.0.ModelHashList=2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9
STMicroelectronics.X-CUBE-AI.10.0.0.ModelKind-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=TFLITE
STMicroelectronics.X-CUBE-AI.10.0.0.ModelMacc-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=295702
STMicroelectronics.X-CUBE-AI.10.0.0.ModelName-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=network
STMicroelectronics.X-CUBE-AI.10.0.0.ModelNameList=network
STMicroelectronics.X-CUBE-AI.10.0.0.ModelRamOccupation-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=69260
STMicroelectronics.X-CUBE-AI.10.0.0.ModelStructureFile-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=C\:\\Users\\fabi_\\OneDrive\\Documentos\\2_M2_oca\\Projet\\voice_recon_mini_V2.tflite
STMicroelectronics.X-CUBE-AI.10.0.0.ModelType-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.0.0.ReadyForCodeGeneration=true
STMicroelectronics.X-CUBE-AI.10.0.0.StackSize=0x2000
STMicroelectronics.X-CUBE-AI.10.0.0.WorkingBufferStartAddrList=0xFFFFFFFF
STMicroelectronics.X-CUBE-AI.10.0.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.10.0.0.copyWeightToRam=false
STMicroelectronics.X-CUBE-AI.10.0.0.copyWeightToRam-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=false
STMicroelectronics.X-CUBE-AI.10.0.0.customLayerConfigEnabled=false
STMicroelectronics.X-CUBE-AI.10.0.0.customLayerConfigEnabled-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=false
STMicroelectronics.X-CUBE-AI.10.0.0.noOnnxIoTranspose=false
STMicroelectronics.X-CUBE-AI.10.0.0.noOnnxIoTranspose-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=false
STMicroelectronics.X-CUBE-AI.10.0.0.useInputAllocation=true
STMicroelectronics.X-CUBE-AI.10.0.0.useInputAllocation-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=true
STMicroelectronics.X-CUBE-AI.10.0.0.useOutputAllocation=true
STMicroelectronics.X-CUBE-AI.10.0.0.useOutputAllocation-2c76707cbc1bfe0859cdd8517a0014c0d641bb633ffe14323fff284030c50ca9=true
STMicroelectronics.X-CUBE-AI.10.0.0_SwParameter=XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;
STMicroelectronics.X-CUBE-ALGOBUILD.1.4.0_SwParameter=LibraryCcDSPOoLibraryJjDSPOoLibrary\:true;
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
VP_ARM.CMSIS_VS_CMSISJjCORE_5.6.0_5.9.0.Mode=CMSISJjCORE
VP_ARM.CMSIS_VS_CMSISJjCORE_5.6.0_5.9.0.Signal=ARM.CMSIS_VS_CMSISJjCORE_5.6.0_5.9.0
VP_ARM.CMSIS_VS_CMSISJjDSP_1.10.0_5.9.0.Mode=CMSISJjDSP
VP_ARM.CMSIS_VS_CMSISJjDSP_1.10.0_5.9.0.Signal=ARM.CMSIS_VS_CMSISJjDSP_1.10.0_5.9.0
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_FATFS_VS_SDIO.Mode=SDIO
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.0.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.0.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.0.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=STM32F746G-DISCO
boardIOC=true
